boundaryLayerStudy/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1806/v10                             |
|   \  /    A nd           | Web:      https://www.OpenFOAM.com              |
|    \/     M anipulation  |           https://www.OpenFOAM.org              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
	(-0.35000000 0.00000000 0.00000000) // 0
	(0.00000000 0.00000000 0.00000000) // 1
	(0.00000000 1.00000000 0.00000000) // 2
	(-0.35000000 1.00000000 0.00000000) // 3
	(-0.35000000 0.00000000 0.05000000) // 4
	(0.00000000 0.00000000 0.05000000) // 5
	(0.00000000 1.00000000 0.05000000) // 6
	(-0.35000000 1.00000000 0.05000000) // 7
	(2.00000000 0.00000000 0.05000000) // 8
	(2.00000000 0.00000000 0.00000000) // 9
	(2.00000000 1.00000000 0.00000000) // 10
	(2.00000000 1.00000000 0.05000000) // 11
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 13 42 1 ) simpleGrading ( 0.06421625840616563 1763.7258815629011 1 ) // 0 
	hex ( 5 1 2 6 8 9 10 11 )  ( 1 42 39 ) simpleGrading ( 1 1763.7258815629011 37.40434344477363 ) // 1 
);

edges
(
);

faces
(
);

boundary
(
	plate
	{
		type wall;
		faces
		(
			(8 9 1 5)
		);
	}
	frontAndBack
	{
		type empty;
		faces
		(
			(0 1 2 3)
			(4 5 6 7)
			(9 1 2 10)
			(8 5 6 11)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 1 0)
			(7 6 2 3)
			(11 10 2 6)
		);
	}
	inlet
	{
		type patch;
		faces
		(
			(4 0 3 7)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(8 9 10 11)
		);
	}
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
