boundaryLayerStudy/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Descomente abaixo e comente a linha 18 para simular esc. turbulento
simulationType      laminar;

// simulationType      RAS;
// 
// RAS
// {
//     RASModel        kOmega;
// 
//     turbulence      on;
// 
//     printCoeffs     on;
// }


// ************************************************************************* //
