boundaryLayerStudy/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces 
{ 
    type          forces; 
 
    libs          ("libforces.so"); 
 
    writeControl  timeStep; 
    writeInterval 5; 
 
    porosity      no; 
 
    patches       (plate); 
    rho           rhoInf;     // Indicates incompressible 
    log           true; 
    rhoInf        1.2;          // Redundant for incompressible 
 
    liftDir       (1 0 0); 
    dragDir       (0 1 0); 
    CofR          (0 0 0);    // Rotation around centre line of propeller 
    pitchAxis     (1 0 0); 
    lRef          1; 
    Aref          1;  // 9.621127501618743e-4; 
}

// ************************************************************************* //
