boundaryLayerStudy/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{ 
    format      ascii; 
    class       dictionary; 
    object      functions; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
 
// #includeFunc MachNo 
#includeFunc residuals 
// #includeFunc forceCoeffsCompressible 
#includeFunc forces 
#includeFunc probes 

// surfaceFieldValue1
// {
//     type            surfaceFieldValue;
//     libs            ("libfieldFunctionObjects.so");
//     enabled         yes;
//     writeControl    writeTime;
//     log             yes;
//     writeFields     no;
//     select          patch;
//     patch           plate;
//     operation       areaAverage;
//     writeArea       true;
//     fields
//     (
//       U
//     );
// } 
// ********************************************************************* //
