boundaryLayerStudy/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------

-----------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes"

fields (p U);
probeLocations
(
    (0.5 0.0 0.00003)
    (0.5 0.1 0.00003)
);

// ************************************************************************* //
